arr = [
    [0, 0, 0, 0, 0, 0, 0, 0, 0, 0],
    [0, 0, 0, 0, 0, 0, 0, 0, 0, 0],
    [0, 0, 0, 0, 1, 0, 3, 0, 0, 0],
    [0, 0, 0, 0, 0, 0, 0, 1, 0, 0],
    [0, 0, 0, 0, 0, 1, 0, 0, 0, 0],
    [0, 0, 1, 0, 0, 0, 0, 0, 0, 0],
    [0, 0, 0, 0, 0, 0, 1, 0, 0, 0],
    [0, 0, 0, 0, 2, 0, 0, 0, 0, 0],
    [0, 0, 0, 0, 0, 0, 0, 0, 0, 0],
    [0, 0, 0, 0, 0, 0, 0, 0, 0, 0],
]

N = 10
dr = [-1,1,0,0] # 상하좌우
dc = [0,0,-1,1]
for r in range(N):
    for c in range(N):
        # 1초과인 숫자 만큼 상하좌우에 -1로 채우기
        if arr[r][c] > 1:
            K = arr[r][c]
            for d in range(4):
                # 해당 방향으로 k만큼 이동
                for k in range(1, K + 1):
                    nr = r + dr[d] * k
                    nc = c + dc[d] * k
                    if 0 <= nr < N and 0 <= nc < N:
                        if arr[nr][nc] == 1:    # 못지나가는 벽
                            break
                        elif arr[nr][nc] != 0:# 다른 숫자의 경우
                            continue
                        arr[nr][nc] = -1


for row in arr:
    print(row)